IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO.

DATA DIVISION.
   WORKING-STORAGE SECTION.
   01 WS-NAME PIC A(30).
   01 WS-ID PIC 9(5) VALUE '2017'.

PROCEDURE DIVISION.
   A000-FIRST-PARA.
   DISPLAY 'Hello'.
   MOVE 'World' TO WS-NAME.
   DISPLAY WS-NAME.
   DISPLAY "I'm learning this in "WS-ID.
STOP RUN.
